package cc.wenmin92.ch1.sec3;

import edu.princeton.cs.algs4.Stack;

/**
 * 假设某个用例程序会进行一系列入栈和出栈的混合栈操作。入栈操作会将整数 0 到 9 按顺序压入
 * 栈；出栈操作会打印出返回值。下面哪种序列是不可能产生的？
 * a. 4 3 2 1 0 9 8 7 6 5
 * b. 4 6 8 7 5 3 2 9 0 1
 * c. 2 5 6 7 4 8 9 3 1 0
 * d. 4 3 2 1 0 5 6 7 8 9
 * e. 1 2 3 4 5 6 9 8 7 0
 * f. 0 4 6 5 3 8 1 7 2 9
 * g. 1 4 7 9 8 6 5 3 0 2
 * h. 2 1 4 3 6 5 8 7 9 0
 *
 * 解析:
 * 笨方法是跟着步骤模拟栈内数据
 * a. 4 3 2 1 0 9 8 7 6 5 (√)
 * b. 4 6 8 7 5 3 2 9 0 1 (4 6 8 7 5 3 2 9 1 0)
 * c. 2 5 6 7 4 8 9 3 1 0 (√)
 * d. 4 3 2 1 0 5 6 7 8 9 (√)
 * e. 1 2 3 4 5 6 9 8 7 0 (√)
 * f. 0 4 6 5 3 8 1 7 2 9 (0 4 6 5 3 8 2 7 1 9)
 * g. 1 4 7 9 8 6 5 3 0 2 (1 4 7 9 8 6 5 3 2 0)
 * h. 2 1 4 3 6 5 8 7 9 0 (√)
 */
public class Ex1_3_3 {
    public static void main(String[] args) {
    }
}
